cube/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 5.023350;

boundaryField
{
      overset
    {
	type overset;
	value $internalField;
    }
    inlet
    {
        type            fixedValue;
        value $internalField;

    }

    outlet
    {
        type            zeroGradient;
    }

 
       flap
    {
        type            kqRWallFunction;
         value $internalField;

    }
   airfoil
    {
        type            kqRWallFunction;
         value $internalField;

    }

   


    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }

}


// ************************************************************************* //
