cube/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh       dynamicOversetFvMesh;

motionSolverLibs (fvMotionSolvers);

motionSolver solidBody;

cellZone movingZone;


solidBodyMotionFunction rotatingMotion; 
rotatingMotionCoeffs {

          origin          (1.02 0.041 0.05);
          axis      (0 0 1);  //units of rad
          omega           100;       //units of rad/s
}


// ************************************************************************* //
