cube/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //



vertices
(
    (-0.75 -0.5 -0.25 )
    (0.75 -0.5 -0.25 )
    (0.75 0.5 -0.25 )
    (-0.75 0.5 -0.25  )
     (-0.75 -0.5 1.25 )
    (0.75 -0.5 1.25 )
    (0.75 0.5 1.25 )
    (-0.75 0.5 1.25 )

    
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (50 20 50) simpleGrading (1 1 1)
);

edges
(
);

boundary
(

    
    overset
    {
        type overset;
        faces
        (
            (3 0 4 7)
            (1 2 6 5)
             (4 5 6 7)
             (0 3 2 1)
        );
    }

        front
    {
        type symmetryPlane;
        faces
        (
            (0 1 5 4)

        );
    }

    back
    {
        type symmetryPlane;
        faces
        (
           
           (2 3 7 6)

        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
