cube/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
actions
(
    {
        name c0; 
	type cellSet; 
	action new; 
	source regionToCell;
        insidePoints ((1.15 0.04 0.005));
    }
{
        name    c1;
        type    cellSet;
        action  new;
        source  cellToCell;
        set c0;
    }
    
    {
        name    c1;
        type    cellSet;
        action  invert;
        
    }

);

// ************************************************************************* //
